{
  "paper": [
    {
      "title": "Searching Data Lakes for Nested and Joined Data",
      "authors": "Yi Zhang, Peter Baile Chen, Zachary Ives",
      "conference": "submitted to SIGMOD 2022",
      "links": {
        "Submitted Paper": "/files/Juneau-SIGMOD22.pdf",
        "Code": "https://github.com/juneau-project/juneau"
      }
    },
    {
      "title": "Fault-tolerant and Transactional Stateful Serverless Workflows",
      "authors": "Haoran Zhang, Adney Cardoza, Peter Baile Chen, Sebastian Angel, Vincent Liu",
      "conference": "OSDI 2020",
      "links": {
        "Paper": "https://www.usenix.org/system/files/osdi20-zhang_haoran.pdf",
        "Code": "https://github.com/eniac/Beldi"
      }
    }
  ],
  "projects": [
    {
      "head": "Program Analysis",
      "summary": "This project aims to extend software/ program analysis tools from a single function to a state machine",
      "desc": [
        "Indepdent project; Advised by Professor Oleg Sokolsky"
      ]
    },
    {
      "head": "ReSolution",
      "summary": "This project aims to tackle the prolonged reinferencing time upon retraining of ML models. One of the applications is the incremental maintenance of entity matching in knowledge graphs and associated query results.",
      "desc": [
        "Independent project; Advised by Professor Zack Ives",
        "Devised the algorithm that uses existing inference results as threshold for subsequent inference results",
        "Adapted techniques from relational databases such as incremental view maintenance to graph databases"
      ]
    },
    {
      "head": "JUpyter Notebook with Enhanced Access and Understanding (JUNEAU)",
      "summary": "JUNEAU is a system of holistic data management tools which can find, standardize, and benefit from the existing resources in the data lake. With much improved scalability, the latest version of Juneau supports searching hierarchical and joined data as well as detecting composite data profiles.",
      "desc": [
        "Collaborating with PhD students; Advised by Professor Zack Ives",
        "Developed the recursive parsing algorithm that normalizes hierarchical data into base relational tables",
        "Initiated the use of sketching techniques to speed up the process of creating and matching data profiles",
        "Enhanced scalability through pre-computations, incremental techniques, and in-database implementations"
      ],
      "links": { "Code": "https://github.com/juneau-project/juneau" }
    }
  ]
}
